[{"priority":"1","category":"firstday","text":"Remember, you don’t have to be “The Teacher.” You can just be friendly and get to know them on a personal level."},{"priority":"2","category":"firstday","text":"It’s okay to not know everything. If you don’t know something, do one of the following:%If it’s a quick question, it’s okay to Google or test demo code%If it’s more involved, say you’ll get back to them next section or by email%It’s OK to not know things. Still appear confident and friendly"},{"priority":"3","category":"firstday","text":"If your students aren’t being responsive:%We like to make awkward jokes until someone is uncomfortable enough to talk%Give a partial solution and see if someone is willing to pick up the rest%Prod with very basic questions and build up`“We need to do _____ many times. What do we need to use?”`“We have a bunch of numbers we need to store…”%Make eye contact with someone if they look like they might have something"},{"priority":"4","category":"firstday","text":"If one of your students is dominating the discussion:%If no one else wants to speak up, you don’t have to force them%It’s okay to actively say that you want to give other people a chance to participate; awkwardly ignoring them doesn’t make things better!"},{"priority":"5","category":"firstday","text":"If the larger group work isn’t working, try splitting into smaller groups (or partners)"},{"priority":"6","category":"firstday","text":"Draw lots of pictures"},{"priority":"7","category":"firstday","text":"Before teaching, explicitly catalogue your assumptions for the explanation of the concepts you’re going over. The things you take for granted or are obvious to you may not be so for students with less experience with the material. You might be caught off guard if a student asks a question about something you think is obviously true."},{"priority":"8","category":"firstday","text":"Students don’t actively give feedback. You’ll get a blank face whether you said “figure it out” or gave the best explanation ever. Interact with your students and prod them for reactions to gauge their understanding%Encourage questions. Even (or especially) the very fundamental ones%To make students more comfortable, consider what you might have felt was confusing before and mention it; something to the effect of “some of you might be wondering why/how/whatever…”"},{"priority":"9","category":"firstday","text":"Some things are beyond the scope of the class; don’t feel pressured to cover everything"},{"priority":"1","category":"structure","text":"Go over worksheet objectives%Help them keep in mind throughout the section what they should be focusing on throughout the next hour%Written at the top of the meta"},{"priority":"2","category":"structure","text":"Ask if they have any questions on recent topics from lecture (Optional)%Only do this if you feel comfortable with answering questions; if you’re not confident with the answer then it’s ok to tell them you don’t know/you’ll get back to them later, either next class or through email%Don’t spend too much time on any one question if it doesn’t apply to the other students"},{"priority":"3","category":"structure","text":"Gauge understanding of students%Directly ask them how comfortable they are with the topic for this week, then ask some questions to test how well they actually know it%Mini lecture if students are confused or lacking knowledge%Feel free to spend as much time on this section as needed"},{"priority":"4","category":"structure","text":"Jumping into the worksheet - conceptual questions%It is good to spend more time explaining, mini lecture until students have the knowledge to complete the question%Then ask students to complete the questions. There are multiple approaches:`You can have students complete the questions on their own and everybody can compare answers afterward`You can pose each question to the whole group, and ask somebody to volunteer an answer.%One difficult part about these questions is that sometimes, if no student is sure of their answer or you have shy students, you will hit an awkward silence. You can deal with this by calling on the students or giving them a hint%The most important thing to do when students are answering these questions is trying to notice what misconceptions the students have, and what their “gap in understanding” is, and what they need to learn to fix that."},{"priority":"5","category":"structure","text":"Jumping into the worksheet - programming questions%Make sure to break down the problem if it’s a wall of text%Explain any given classes or code%Draw out an example of the sample input if needed%Individual work:`Give them enough time to work on the problem alone until you feel that they’re stuck%Group work:`Have them pair up and discuss their ideas/solutions to each other%Coming back together:`Discuss the question as a group and ask students for their ideas/solutions and write one or a combination of their solutions on the board or`Ask one student to volunteer their solution as you write it out on the board"},{"priority":"6","category":"structure","text":"If the students finish the worksheet early, good options are%Go more in depth for the more complicated questions from the same worksheet; revisit concepts that were challenging%Go over a worksheet from a previous week; this is material that you should be familiar with already so you won’t need extra time to prep`Even if the worksheet for next week is out, don’t go over the next week’s worksheet yet%Go over questions they might have outside of the worksheet; again, only go over questions you’re comfortable with%Dismiss class early"},{"priority":"1","category":"atmosphere","text":"At the beginning of the semester, it’s crucial to create a relaxed environment where all the students are comfortable with each other and they are comfortable asking you questions.%Remember that the point of CSM is to have a small section where students can clarify their understanding, and having them trust you and be open to questions is key to achieving that"},{"priority":"2","category":"atmosphere","text":"Know their names! Make it a big point to address each student by their names very early on in the semester. Doing an ice breaker at the first section is one way for everyone to know each other’s names:%Ice breakers can be as simple as Name, Major, Favorite food"},{"priority":"3","category":"atmosphere","text":"Some ideas on how to break the tension during the semester:%Ask how life/their weekend/their classes are going%Tell really awkward jokes to make them laugh out of awkwardness (it works, I promise)%Bring food to section eg. even something small like candy%Relate to them by complaining about classes/midterms/projects together"},{"priority":"4","category":"atmosphere","text":"In general, you want to be someone that they’re comfortable talking to rather than only being an answer dispensing robot. "},{"priority":"1","category":"silent","text":"They don't understand the material enough or couldn't complete the question.%May want to diagnose this by giving students more time to work on a problem, if appropriate, or providing hints to help guide them in the right direction if they're struggling with starting a problem.%If students seem far behind in the course, it's more useful to give a mini-lecture at the beginning of section to help students catch up on material. You might even want to show them how to do part of a problem before allowing them to try it out."},{"priority":"2","category":"silent","text":"They aren't confident in their answers.%Have students talk to the person next to them: it's usually less stressful to share a solution with the person next to you rather than to the entire section.%Acknowledge and encourage questions or answers: whenever a student speaks up, frame their questions in a positive light. It might not seem like much to add, \"Great question\", but it does help."},{"priority":"3","category":"silent","text":"They're tired or just completed a project/midterm.%Let students know that you understand this is a problem. Be more energetic and students might respond more strongly to that."},{"priority":"4","category":"silent","text":"They aren't comfortable speaking up in sections, whether it's asking or answering questions.%The questions you're asking them might be too trivial. Leading questions or \"are you following?\" questions can be good, but need to be used with good judgement.%Students might not be given enough time to respond to you. Be careful about cutting students off when they're speaking or not leaving enough time for them to come up with a question. As a teacher, it can often feel like an eternity but students need the time to collect their thoughts%Address students by their names. This is especially true in these small group sections."},{"priority":"1","category":"difference","text":"It’s difficult to cater to all the different levels at once, so don’t panic if it doesn’t seem like every student is engaged during every second of your section"},{"priority":"2","category":"difference","text":"Progression in difficulty of the worksheet%Each worksheet and each section in general should have a progression starting from covering the basics and leading into more advanced understanding at the end "},{"priority":"3","category":"difference","text":"Gauge your students’ understanding at the beginning of lecture%This is the time to figure out their baseline level of understanding; if they need to start from the basics, then you’ll need to spend most of your time giving a mini lecture and going over basic examples and practice problems.%Don’t move on to doing the problems or going deeper into the concepts until you’ve at least tried to get everyone to understand the basics.%If everyone is ready to move on except for just one person and you’ve already spent a good amount of time:`If there’s a problem based on the same concept the rest of the students can work on, it’s fine to have them start the problem while you help that student one-on-one`Otherwise don’t spend the entire section to catch that one student up; move on and get back to them later"},{"priority":"4","category":"difference","text":"Once the basics are covered (conceptually), you can move on to doing problems that check/reinforce their understanding"},{"priority":"5","category":"difference","text":"More advanced questions come last. Generally the worksheet problems will be ordered in this way, from basic to more advanced"},{"priority":"1","category":"questions","text":"Conceptual Problems - Problems designed to help students understand the underlying concepts. E.G. “When can we use Radix Sort?”%Have students relate new concepts to older concepts`How is X different from Y?`When would we use X over Y (and vise versa)?`What are some of the pros and cons of X and Y?%Help students understand the reasoning behind running times`Why does this operation take O(f(n)) time?`Why is this operation O(f(n)) instead of O(g(n))?`Where does this portion of the running time come from?"},{"priority":"2","category":"questions","text":"Implementation Problems - Problems that ask your students to write code. E.G. “Implement put for a HashMap”%Ask questions to help students determine which data structures to use`What running times are we trying to achieve?`Will our data be static or dynamic in size?`Do we care about the ordering of our data?`What kinds of operations will we be performing often? (e.g. checking membership, accessing indices, finding max/min element, etc)%Ask questions to help students determine which technique to use`We need to ____ several times. What can we use to do that?`What do we usually do to solve Linked List problems?`What is the base case?`Can we store any data that might be useful later?"},{"priority":"3","category":"questions","text":"Design Problems - Problems that ask your students to come up with a high level “solution” to a problem or design to a system. E.G. “How would you make an LRU cache server?”%A good way to approach design problems is to break it down into 4 parts:`1. What are our assumptions? What can we take for granted to be true? (Preconditions on the input, what methods are implemented for us, etc.)`2. What are our success conditions? What do we need to complete to successfully solve the question. (Runtime constraints, required functionality, etc.)`3. What tools do we have that might help us? (Data structures and algorithms which offer parts of desired functionality and runtime constraints…) *Note: not every tool listed necessarily has to be part of the solution; it’s okay to not use every tool we end up listing.`4. How can we synthesize our tools to fulfill our conditions given our assumptions? (How can we combine our data structures and algorithms to fulfill our various runtime constraints)%Often times, problems are variants of other problems. It may be helpful to list previously seen, similar problems and compare the necessary components of the solutions"},{"priority":"4","category":"questions","text":"Checking Understanding%For conceptually difficult topics, check understanding often/at each step"},{"priority":"1","category":"logistic","text":"Normal room taken%Contact President OR SM (response ASAP)%In the meantime: Take some lobby space, find some open space%Good spaces to check:`Kresge (as a whole)`Cory 2nd floor`Soda 6th floor`3rd floor table in alcove of Cory where the bridge to SDH is`3rd floor of Sutardja Dai"}]